ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
// Copyright (c) 2023 Ziga Miklosic
// All Rights Reserved
////////////////////////////////////////////////////////////////////////////////
/**
*@file      ble_p.c
*@brief     Bluetooth Peripheral drivers
*@author    Ziga Miklosic
*@date      10.01.2023
*@version   V1.0.0
*
*@note      This file shall be in following directory:
*           
*               /drivers/peripheral/ble
*/
////////////////////////////////////////////////////////////////////////////////
/*!
* @addtogroup BLE_P
* @{ <!-- BEGIN GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Includes
////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>
#include <stdlib.h>
#include "project_config.h"

#include "ble_p.h"
#include "middleware/ring_buffer/src/ring_buffer.h"




#include "app_timer.h"

// For softdevice
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

// BLE queue manager to stack
#include "nrf_ble_qwr.h"

// GATT
#include "nrf_ble_gatt.h"

// For advertisement
#include "ble_advertising.h"
 
 // For connection parameters
#include "ble_conn_params.h"


// TODO: Remove LED FOR DEBUG
#include "drivers/hmi/led/led/src/led.h"




// Debug COM port
#include "middleware/cli/cli/src/cli.h"


////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

/**
 *      BLE Peripheral data
 */
typedef struct
{
    uint16_t conn_handle;       /**< Connection Handle on which event occurred */


} ble_p_data_t;


/**
 *		BLE Peripheral reception buffer size
 *
 *	Unit: byte
 */                     
#define BLE_P_RX_BUF_SIZE                   ( 512 )  

/**
 * 	Enable/Disable debug mode
 *
 * 	@note	Disable in release!
 */
#define BLE_P_DEBUG_EN						( 1 )

#ifndef DEBUG
    #undef BLE_P_DEBUG_EN
    #define BLE_P_DEBUG_EN 0
#endif

/**
 *  Enable/Disable assertion
 *
 *  @note   Disble in release!
 */
 #define BLE_P_ASSERT_EN                    ( 1 )

#ifndef DEBUG
    #undef PAR_CFG_ASSERT_EN
    #define PAR_CFG_ASSERT_EN 0
#endif

/**
 * 	Debug communication port macros
 */
#if ( 1 == BLE_P_DEBUG_EN )
	#define BLE_P_DBG_PRINT( ... )			( cli_printf( __VA_ARGS__ ))
#else
	#define BLE_P_DBG_PRINT( ... )			{ ; }

#endif

/**
 *  Assertion definition
 */
 #if ( BLE_P_ASSERT_EN )
	#define BLE_P_ASSERT(x)                 { PROJECT_CONFIG_ASSERT(x) }
 #else
  #define BLE_P_ASSERT)                     { ; }
 #endif



















/**
 *      BLE Event priority
 */
#define BLE_EVENT_PRIORITY              3 

/**
 *      BLE connection tag
 */ 
#define BLE_CONN_CFG_TAG                ( 1 )


/******************************************************************
 *      GAP RELATED
 ******************************************************************/

/**
 *      Device name
 */
#define GAP_DEVICE_NAME                     ( "My BLE Device" )

/**
 *      Minimum connection interval
 *
 *  Unit: ms
 */
#define GAP_MIN_CONN_INTERVAL_MS            ( 100 ) 

/**
 *      Maximum connection interval
 *
 *  Unit: ms
 */
#define GAP_MAX_CONN_INTERVAL_MS            ( 200 ) 

/**
 *      Slave latency
 */
#define GAP_SLAVE_LATENCY                   ( 0 )

/**
 *      Suppervsision timeout
 *
 * @note    If device is not responding within that time the connection
 *          will be terminated!
 *
 *  Unit: ms
 */
#define GAP_SUPERVISION_TIMEOUT_MS          ( 4000 )



/******************************************************************
 *      ADVERTISEMENT
 ******************************************************************/

 /**
  *     Advertisement inteval
  * 
  * @note   In units of 0.625 ms. E.g. value of 300 corresponds to 187.5 ms.
  *
  * @note   Place time in ms as it will be re-calculated later into proper values!
  *
  *     Unit: ms
  */
#define GAP_ADV_INTERVAL_MS                 ( 200.0 )

/**
 *      Advertisement duration
 *
 * @note    In units of 10 milliseconds. Anyway place time in ms as it 
 *          will be re-calculated later into proper values!
 *
 * @note    Set to 0 if wanted continous advertisement!  
 *   
 *  Unit: ms
 */
#define GAP_ADV_DURATION_MS                 ( 0 )


/******************************************************************
 *      CONNECTIONS
 ******************************************************************/

#define FIRST_CONN_PARAMS_UPDATE_DELAY      APP_TIMER_TICKS(5000)                   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(30000)                  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       /**< Number of attempts before giving up the connection parameter negotiation. */





////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

/**
 *      Initialization guards
 */
static bool gb_is_init = false;

/**
 *      Reception buffer space
 */
static uint8_t gu8_ble_rx_buffer[BLE_P_RX_BUF_SIZE] = {0};

/**
 *      UART Rx buffer
 */
static p_ring_buffer_t 		g_rx_buf = NULL;
const ring_buffer_attr_t 	g_rx_buf_attr = 
{ 	
    .name 		= "BLE P Rx Buf",
    .item_size 	= sizeof(uint8_t),
    .override 	= false,
    .p_mem 		= &gu8_ble_rx_buffer 
};

/**
 *      BLE Peripheral data
 */
static ble_p_data_t g_ble_p = 
{ 
    .conn_handle = BLE_CONN_HANDLE_INVALID,

};
    




// For single connected device
NRF_BLE_QWR_DEF( m_qwr );

// For multi connected devices
//NRF_BLE_QWRS_DEF()

// GATT instance
NRF_BLE_GATT_DEF( m_gatt );

// Advertising instance
BLE_ADVERTISING_DEF( m_advertising );


// TODO: Check if can be omited!
//static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;


#define ADV_DATA_SIZE       ( 15 )
static uint8_t my_adv_data[ADV_DATA_SIZE] = { 0 };


// Available services as it will be part of advertisement packet
static ble_uuid_t m_adv_uuids[] = 
{ 
    {   .uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE,    .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
    {   .uuid = BLE_UUID_BATTERY_SERVICE,               .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
};



static ble_gatts_char_handles_t    char_handles    = {0};

#define THERMOSTAT_SERVICE_BASE                                                \
  {                                                                            \
    0x2A, 0x94, 0x01, 0x0a, 0x34, 0xc4, 0x3e, 0xbc, 0xe5, 0x4b, 0xb3, 0x8b,    \
        0x00, 0x00, 0x9d, 0xaf                                                 \
  }

#define THERMOSTAT_SERVICE_UUID   0x1000


#define BLE_THERMOSTAT_RX_CHARACTERISTIC   0x1001
#define BLE_THERMOSTAT_TX_CHARACTERISTIC   0x1002

static ble_gatts_char_handles_t    rx_char_handles    = {0};
static ble_gatts_char_handles_t    tx_char_handles    = {0};




////////////////////////////////////////////////////////////////////////////////
// Function prototypes
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t   ble_p_stack_init    (void);
static void             ble_p_evt_hndl      (ble_evt_t const * p_ble_evt, void * p_context);



////////////////////////////////////////////////////////////////////////////////
// Functions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE peripheral stack
*
* @return 		status - Status of initialization
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_stack_init(void)
{
    ble_p_status_t  status      = eBLE_P_OK;
    uint32_t        ram_start   = 0;  // Application RAM start address

    // Start SoftDevice
    if ( NRF_SUCCESS != nrf_sdh_enable_request())
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable request error!" );
    }

    // Configure BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_default_cfg_set( BLE_CONN_CFG_TAG, &ram_start ))
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice default config set error!" );
    }

