ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    return status;
}


// Init GATT
static ret_code_t gatt_init(void)
{
    ret_code_t status = NRF_SUCCESS;

    if ( NRF_SUCCESS != nrf_ble_gatt_init( &m_gatt, NULL ))
    { 
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );  
    }

    return status;
}



// Advertisement handler
static void adv_evt_hndl(ble_adv_evt_t ble_adv_evt)
{

    switch (ble_adv_evt)
    {
        // Advertisement START
        case BLE_ADV_EVT_FAST:

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_START );

            break;
        
        // Advertisement STOP
        case BLE_ADV_EVT_IDLE:

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_END );

            break;

        default:
            break;
    }
}

// Init advertisment
static ret_code_t advertisement_init(void)
{
    ret_code_t              status   = NRF_SUCCESS;
    ble_advertising_init_t  adv_init = {0};

    // Set up advertising parameters
    adv_init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
    adv_init.advdata.include_appearance     = true;
    adv_init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_init.config.ble_adv_fast_enabled    = true;
    adv_init.config.ble_adv_fast_interval   = (uint32_t) ( GAP_ADV_INTERVAL_MS / 0.625f );
    adv_init.config.ble_adv_fast_timeout    = (uint32_t) ( GAP_ADV_DURATION_MS / 10.0f );
    adv_init.evt_handler                    = adv_evt_hndl;


    
    /****************************************************************
     *  SHOWING TX POWER LEVEL
     */
    
    int8_t tx_level = 1;
    adv_init.advdata.p_tx_power_level = &tx_level;

    /****************************************************************
     *  SHOWING AVAILABLE SERVICES IN ADVERTISEMENT PACKETS
     */
    
    // Show also available services in advertisement packet
    adv_init.advdata.uuids_complete.p_uuids = (ble_uuid_t*) &m_adv_uuids;
    adv_init.advdata.uuids_complete.uuid_cnt = 2;



    /****************************************************************
    *  ADDING SERVICE DATA TO ADVERTISEMENT PACKET
    */
    #if 0
    uint8_t                        bat_level       = 12;
    ble_advdata_service_data_t     service_data    = {0};

    // Set up service data
    service_data.service_uuid      = BLE_UUID_BATTERY_SERVICE;
    service_data.data.size         = sizeof( bat_level);
    service_data.data.p_data       = (uint8_t*) &bat_level;

    // Add to advertisement data
    adv_init.advdata.p_service_data_array   = &service_data;
    adv_init.advdata.service_data_count     = 1;


    #endif


    /****************************************************************
     *  SETTING UP MANUFACTURER DATA INSIDE ADVERTISEMENT PACKET
     */
    
    #if 0
        ble_advdata_manuf_data_t man_data =
        {
            .company_identifier = 0x00ff,
            .data = 
            {
                .p_data = (uint8_t*) &my_adv_data,
                .size = ADV_DATA_SIZE,
            }
        };

        adv_init.advdata.p_manuf_specific_data = &man_data;
    #endif

        
        
        // Set Long Range Advertisement PHY
        //adv_init.config.ble_adv_primary_phy     = BLE_GAP_PHY_CODED;
        //adv_init.config.ble_adv_secondary_phy   = BLE_GAP_PHY_CODED;
        


    /****************************************************************
     *  SETTING UP CONNECTION INTERVAL RANGE
     */
    
    ble_advdata_conn_int_t slave_conn_int = 
    {
        .min_conn_interval = (uint16_t)( 100 / 1.25 ),        /**< Minimum connection interval, in units of 1.25 ms, range 6 to 3200 (7.5 ms to 4 s). */
        .max_conn_interval = (uint16_t)( 200 / 1.25 ),         /**< Maximum connection interval, in units of 1.25 ms, range 6 to 3200 (7.5 ms to 4 s). The value 0xFFFF indicates no specific maximum. */
    };

    adv_init.advdata.p_slave_conn_int = &slave_conn_int;






    // Init advertisement
    if ( NRF_SUCCESS != ble_advertising_init( &m_advertising, &adv_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }
    
    // Setup advertising config tag
    ble_advertising_conn_cfg_tag_set( &m_advertising, BLE_CONN_CFG_TAG );

    return status;
}



static void advertisement_start(void)
{
    if ( NRF_SUCCESS != ble_advertising_start( &m_advertising, BLE_ADV_MODE_FAST ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }
}



static void nrf_qwr_error_hndl(uint32_t nrf_error)
{
    // Handler errors here...

}

// Init services
static ret_code_t services_init(void)
{
    ret_code_t          status      = NRF_SUCCESS;
    nrf_ble_qwr_init_t  qwr_init    = { 0 };

    // Register error hander
    qwr_init.error_handler = nrf_qwr_error_hndl;

    // Init QWR
    if ( NRF_SUCCESS != nrf_ble_qwr_init( &m_qwr, &qwr_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

    return status;
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *
 * @note    All this function does is to disconnect. This could have been done by simply
 *          setting the disconnect_on_fail config parameter, but instead we use the event
 *          handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect( g_ble_p.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE );
        
        // TODO: 
        //APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    // TODO: 
   // APP_ERROR_HANDLER(nrf_error);
}


// Init connection parameters
static ret_code_t conn_pars_init(void)
{
    ret_code_t              status  = NRF_SUCCESS;
    ble_conn_params_init_t  cp_init = {0};


    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    if ( NRF_SUCCESS != ble_conn_params_init( &cp_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

